#include <stdio.h>

int main()
{
    int arr[5]={658, 228, 80, 530, 527};//масив з невідсортованими даними
    //сортування вставками
    for (int i = 1; i < 5; i++)//проходимо по всім елементам
    {
        int k=i;//запам'ятовуємо початкове положення елемента
        while(k >= 0 && arr[k-1] > arr[k])//поки зліва існують елементи і лівий елемент більший за обраний
        {
            //міняємо елементи місцями
            int tmp = arr[k-1];
            arr[k-1] = arr[k];
            arr[k] = tmp;
            k-=1; // зсув позиції елемента ліворуч
        }
    }
    printf("Sorted array:\n");
    //виводимо на екран відсортований масив
    for (int i = 0; i < 5; i++)
    {
        printf("%d ", arr[i]);
    }
    return 0;
}