#include <stdio.h>
int main()
{
    int arr[5] = {8, 5, 9, 2, 3};//несортований масив
    //сортування методом Шелла
    int d = 5/2;//початковий приріст
    while (d > 0)//поки існує приріст
    {
        for (int i = 0; i < 5; i++)// для всіх елементів масиву
        {
            int j = i;// запам'ятовуємо елемент і індекс
            int temp = arr[i];
            // проходимо всі інші елементи масиву, позиція яких відрізняється від j-ого елемента на величину прироста
            while ((j >= d) && (arr[j - d] > temp))//доки віддалений елемент більше
            {
                arr[j] = arr[j - d];// переміщуємо його на поточне місце
                j = j - d;// переходимо до наступного віддаленого елемента
            }
            arr[j] = temp;// поміщаємо на місце збережений елемент
        }
        if (d > 1)// ділимо приріст на 2
            d = d / 2;
        else if (d == 1)// останній прохід завершено
            break;// вихід з циклу
    }
    printf("Sorted array:\n");//виведення відсортованого масиву на екран
    for (int k = 0; k < 5; k++)
    {
        printf("%d ", arr[k]);
    }
    return 0;
}